<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class SettingsController extends Controller
{
    public function index()
    {
        $technical = array(
            array(
                "subject" => "จํานวนนักศึกษาระดับบัณฑิตศึกษาภายโต้การดูแลของท่านที่ได้รับการสนับสนุนที่มีคุณภาพมากกว่าเกณฑ์มาตรฐาน สกอ.",
                "detail" => "ท่านได้เป็นที่ปรึกษาที่ดูแลนักศึกษาและทําให้นักศึกษามีผลงานตีพิมพ์มากกว่าเกณฑ์มาตรฐาน สกอ.",
                "unit" => "คน"
            ),
            array(
                "subject" => "จํานวนโครงการวิจัยในรูปแบบแผนบูรณาการงานวิจัย (Research program)",
                "detail" => "อาจารย์ได้มีส่วนร่วมโนการทําโครงการวิจัยที่เกิดจากการบูรณาการงานวิจัยร่วมกับคณะอื่น",
                "unit" => "โครงการ"
            ),
            array(
                "subject" => "จํานวนโครงการที่ได้เริ่มดําเนินการการสร้างนวัตกรรมเชิงพาณิชย์",
                "detail" => "อาจารย์มีโครงการหรือกิจกรรมที่ตําเนินการไปสู่การเกิดนวัตกรรมที่ทําให้เกิตรายได้แก่คณะในอนาคด",
                "unit" => "โครงการ"
            ),
            array(
                "subject" => "การตํารงตําแหน่งทางวิชาการที่สูงขึ้น",
                "detail" => "ในรอบ 1 มกราคม 2564 - 31 ธันวาคม 2564 อาจารย์ได้รับการตั้งแต่งให้ตํารงตําแหน่งทางวิชาการที่สูงขึ้นโดยนับวันที่สภามหาวิทยาลัยเห็นชอบ",
                "unit" => "ศ. รศ. ผศ."
            ),
            array(
                "subject" => "จํานวนเงินรายได้จากการบริการวิชาการ (จากการทําสัญญา)",
                "detail" => "มีโครงการที่ทําสัญญาและเกิดรายได้จากการบริหารวิชาการให้แก่คณะ",
                "unit" => "บาท"
            ),
            array(
                "subject" => "จำนวนโครงการบริการวิชาการที่ทําให้กับชุมชน",
                "detail" => "มีโครงการที่ไปบริการวิชาการให้กับชุมชน",
                "unit" => "โครงการ"
            ),
            array(
                "subject" => "จํานวนผลงานที่ได้รับทุนสนับสนุนจากภายนอกที่ถูกนําไปใช้ประโยชน์ (CSV)",
                "detail" => "มีโครงการที่สามารถนำงบประมาณจากหน่วยงานภายนอกไปช่วยสังคม โดยใช้ผลงานหรือองค์ความรู้ที่อาจารย์ผลิตขึ้นมา",
                "unit" => "ผลงาน/ชิ้น"
            ),
            array(
                "subject" => "จํานวนผลงานวิจัย/สิ่งประดิษฐ์/นวัตกรรมด้าน Digital Technology",
                "detail" => "ต้องมีผลงานด้าน Digital Technology",
                "unit" => "ผลงาน/ชิ้น"
            ),
            array(
                "subject" => "จํานวนนักศึกษาต่างขาติทั้งแบบปกติและ non-degree ภายใต้การดูแลของท่าน ทั้ง outbound และ Inbound ระดับปริญญาตรีและระดับบัณฑิตศึกษา",
                "detail" => "ท่านได้เป็นที่ปรึกษาที่ตูแลนักศึกษาต่างชาติทั้งแบบปกติและ non-degree ภายใต้การดูแลของท่าน ทั้ง outbound และ Inbound ระดับปริญญาตรีและระดับบัณฑิตศึกษา",
                "unit" => "คน"
            ),
            array(
                "subject" => "โครงการฟาร์มอัจฉริยช (Smart Farm)",
                "detail" => "มีโครงการหรือกิจกรรมที่เกี่ยวกับด้านฟาร์มอัจอริยะโดยโครงการนั้นต้องถูกนํามาใช้ในการเรียนการสอน การทําวิจัย และการบริการวิชาการ ครบทั้ง 3 ด้าน",
                "unit" => "โครงการ"
            ),
            array(
                "subject" => "จำนวนบทเรียนออนไลน์สะสม",
                "detail" => "มีการอัดวิดีโอบทเรียน เพื่อให้ นศ. สามารถตูย้อนหลังได้",
                "unit" => "โครงการ"
            ),
            array(
                "subject" => "จำโครงการเมืองอัจฉริยะ (Smart City)",
                "detail" => "มีโครงการหรือกิจกรรมที่เกี่ยวกับด้านฟาร์มอัจอริยะโดยโครงการนั้นต้องถูกนํามาใช้ในการเรียนการสอน การทําวิจัย และการบริการวิชาการ ครบทั้ง 3 ด้าน",
                "unit" => "บาท"
            ),
        );

        $support = array(
            array(
                "subject" => "จํานวนโครงการที่ได้เริ่มดําเนินการ (การสร้างนวัตกรรมเชิงพาณิชย์)",
                "detail" => "โครงการหรือกิจกรรมที่ดําเนินการไปสู่การเกิดนวัตกรรมที่ทําให้เกิดรายได้แก่คณะในอนาคต",
                "unit" => "โครงการ"
            ),
            array(
                "subject" => "จํานวนเงินรายได้จากการบริการวิชาการ (จากการทําสัญญา)",
                "detail" => "โครงการที่ทําสัญญาและเกิดรายได้จากการบริการวิชาการให้แก่คณะ",
                "unit" => "บาท"
            ),
            array(
                "subject" => "จํานวนโครงการบริการวิชาการที่ทําให้กับชุมชน",
                "detail" => "โครงการที่ไปบริการวิชาการให้กับขุมชน",
                "unit" => "โครงการ"
            ),
            array(
                "subject" => "จํานวนผลงานวิจัย/สิ่งประดิษฐ์/นวัตกรรมด้าน Digital Technolagy",
                "detail" => "ผลงานด้าน Digital Technology",
                "unit" => "ผลงาน"
            ),
            array(
                "subject" => "จํานวนงานสะสมที่ได้รับการพัฒนาใหม่หรือปรับปรุง",
                "detail" => "งานที่มีการพัฒนาขั้นตอน/ระบบ/วิธีการทํางานหรืองานที่พัฒนาขึ้นมาใหม่",
                "unit" => "ผลงาน"
            ),
        );

        return view("OKI.settings", ["technical" => $technical, "support" => $support]);
    }

    public function store(Request $request)
    {
        dd($request->only("subject", "detail", "unit"));
    }
}